tap "homebrew/bundle"
# General-purpose data compression with high compression ratio
brew "xz"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Vector graphics library with cross-device output support
brew "cairo"
# Library for encoding and decoding .avif files
brew "libavif"
# Distributed revision control system
brew "git"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# File format designed to store large amounts of data
brew "hdf5"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Pager program similar to more
brew "less"
# Next-gen compiler infrastructure
brew "llvm"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# Application launcher and productivity software
cask "alfred"
# Git client focusing on productivity
cask "gitkraken"
mas "GarageBand", id: 408980954
mas "iMovie", id: 408981434
mas "iPhoto", id: 408981381
mas "iZip Unarchiver", id: 717545828
mas "Keynote", id: 409183694
mas "Kindle Classic", id: 405399194
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Speedtest", id: 1153157709
mas "Xcode", id: 497799835
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "twxs.cmake"
