tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# General-purpose data compression with high compression ratio
brew "xz"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Vector graphics library with cross-device output support
brew "cairo"
# Library for encoding and decoding .avif files
brew "libavif"
# Distributed revision control system
brew "git"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# File format designed to store large amounts of data
brew "hdf5"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Next-gen compiler infrastructure
brew "llvm"
# Internet file retriever
brew "wget"
# Application launcher and productivity software
cask "alfred"
# Git client focusing on productivity
cask "gitkraken"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "twxs.cmake"
